/*คำสั่งในการวนลูป โปรแกรมจะทำงานไปจนกว่าเงื่อนไขที่กำหนดไว้จะเป็นเท็จถึงจะหยุด
คำสั่ง break : สั่งหยุดทำงายในลูป แล้วไปทำงานตามคำสั่งอื่นนอกลูป
     continue : สั่งหยุดทำงานแล้วย้อนไปเริ่มทำงานที่ต้นลูปใหม่


1. while loop
while(เงื่อนไข){
    console.log("Hi Hi");
}*/

let count = 1;
while(count<=5){ //เงื่อนไขหากcountน้อยกว่าหรือเท่ากับ5ให้แสดงผล Hi
    console.log("Hi");
    count++; //กำหนดให้countเพิ่มที่ละ1แล้วไปเช็คที่เงื่อนไข 1 2 3 4 5 6
} //output 'Hi''Hi''Hi''Hi''Hi' แสดง5ตัวเพราะเลข6ไม่เข้าเงื่อนไขแล้ว

let count = 1;
while(count<=2){ //ถ้าเงื่อนไขเป็นจริง
    console.log("รายการที่ ",count);
    count++;
} //output; 'รายการที่ ' 1 'รายการที่ ' 2

let count = 1;
while(count<=5){ //ถ้าเงื่อนไขเป็นจริง
    console.log("รายการที่ ",count);
    if(count==3){
        break;
    }
    count++;
} //output; 'รายการที่ ' 1 'รายการที่ ' 2 'รายการที่ ' 3

/*2. For loop

for(ค่าเริ่มต้นของตัวแปร; เงื่อนไข; เปลี่ยนแปลงค่าตัวแปร){
    คำสั่งเมื่อเงื่อนไขเป็นจริง;
}

for(let i = 1; i<= 10; i++){
    คำสั่งเมื่อเงื่อนไขเป็นจริง;
}*/

for(let count = 1; count<=5; count++){  //ถ้าอยากไห้+ทีละ2,3 เขียน count+=2, count+=3
    console.log("Hi 5") //มันจะเช็คทีละรอบ เช็คเลข1 ถ้า้ง่อนไขเป็นจริงจะแสดงผล 1รอบ เช็คเลขเพิ่มทีละ1ไปเรื่อย
} //output 'Hi 5''Hi 5''Hi 5''Hi 5''Hi 5'

for(let count = 10; count>=1; count--){ //ต้องการนับเลขจาก10ถึง1
    console.log("count")
}



